app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-07-10 00:04:54.850179"], ["updated_at", "2018-07-10 00:04:54.850179"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-07-10 00:04:54.859939"], ["updated_at", "2018-07-10 00:04:54.859939"]]
---
  def upload
    ##create artists first then create songs
    #song belongs to an artist
    #byebug
    CSV.foreach(params[:songs].path, headers: true) do |lead|
      new_artist = Artist.create(name: song[1])